package com.javarush.test.level04.lesson10.task04;





/* S-квадрат
Вывести на экран квадрат из 10х10 букв S используя цикл while.
Буквы в каждой строке не разделять.
*/


import java.io.*;

public class Solution
{
    public static void main(String[] args) throws Exception
    {
        String s = "SSSSSSSSSS";
        int i = 0;

        while (i < 10){
            System.out.println(s);
            i += 1;

        }



        //напишите тут ваш код

    }
}
